{
  "core_analogy": "Gravity = Universe's obsessive stalker. Every object in the universe is CONSTANTLY pulling on you right now - the Moon, the Sun, even your crush sitting across the room. The bigger and closer they are, the more desperately they're pulling. Earth just happens to be the most aggressive stalker because it's MASSIVE and RIGHT UNDER YOUR FEET.",
  "subconscious_hook": "Identity challenge + Curiosity gap. 'You're falling RIGHT NOW' creates cognitive dissonance - viewer KNOWS they're sitting still but is told they're falling. This creates an unbearable itch to resolve the contradiction. Also triggers existential wonder (we're constantly being pulled by invisible cosmic forces).",
  "visual_scenes": {
    "01_hook": "Person sitting on chair, suddenly camera zooms out DRAMATICALLY to show Earth rotating, then further to show Moon pulling, Sun pulling - arrows from everywhere pointing at the tiny person. Text: 'You're FALLING right now'. Everything vibrates with tension lines showing invisible pull.",
    "02_setup": "Split screen: Left shows apple falling from tree (Newton's famous story). Right shows Moon orbiting Earth. Dotted line connects both - 'SAME FORCE?' text appears with question mark pulsing. Newton silhouette appears thinking.",
    "03_content_part1": "FieldVisualizer showing gravitational field lines emanating from Earth like a cosmic octopus. Two masses appear (M1 and M2) with 'r' distance between them. Formula F = G(M1×M2)/r² builds piece by piece: G appears as a tiny number (6.67 × 10⁻¹¹) labeled 'Universe's weakness constant - gravity is actually PATHETICALLY weak!'",
    "03_content_part2": "MechanicsSimulator: Two scenarios side by side. Scenario A: Double the mass → arrow doubles in size (force doubles). Scenario B: Double the distance → arrow shrinks to 1/4 (inverse square shown visually as spreading light from flashlight - further = weaker by square). Calculator showing: 2× distance = 1/4 force, 3× distance = 1/9 force.",
    "04_reveal": "Zoom into your hand holding phone. Suddenly thousands of tiny arrows appear from EVERYWHERE - from Earth (big arrow), from Moon (tiny arrow), from Sun (medium arrow), from the person next to you (microscopic arrow). Text: 'EVERYTHING pulls on EVERYTHING. Always. Forever.' Mind-explosion effect with particles.",
    "05_key_point": "Visual comparison: Electromagnetic force vs Gravitational force shown as two arm wrestlers - EM is HULK-sized, Gravity is ant-sized. Yet gravity wins at cosmic scale because it NEVER gives up and ALWAYS attracts (no negative gravity). Text: 'Weak but RELENTLESS = Gravity shapes the universe'.",
    "06_exam_tip": "JEE/NEET problem flash: 'If Earth's mass doubled and radius doubled, what happens to g?' Visual shows the formula g = GM/R². Mass doubles (×2 in numerator), R² quadruples (×4 in denominator). Answer: g becomes HALF. Red circle around 'R² in denominator - distance is SQUARED!'",
    "07_cta": "Person finally 'feeling' gravity - animated weight pressing down on shoulders with smile. Text: 'Now you FEEL it, right?' Follow button pulses. 'More physics that'll rewire your brain ↓'"
  },
  "virality_factor": "The 'everything is pulling on everything' revelation is HIGHLY shareable - people will screenshot and send to friends saying 'bro did you know your crush is literally gravitationally attracted to you rn?' The stalker analogy is memorable and slightly uncomfortable in a way that sticks. Also the 'gravity is pathetically weak' fact contradicts intuition and begs to be shared.",
  "mind_blow_moment": "The reveal that gravity is actually the WEAKEST force in the universe, yet it shapes galaxies and holds the cosmos together because it's relentless and never repels. A magnet can defeat Earth's entire gravity with one hand - but gravity wins in the end because it never stops, never pushes away, and adds up across infinite distances.",
  "duration_target": "78s",
  "simplification_strategy": "1) 'G constant' = 'Universe's weakness setting' (makes the tiny number relatable). 2) Inverse square law = 'Flashlight spreading' (everyone's seen light get dimmer with distance). 3) Force formula = 'Stalker equation' (bigger stalker + closer distance = stronger pull). 4) Every jargon gets a visual: mass = size of glowing orb, distance = ruler that stretches, force = arrows with thickness showing strength.",
  "logic_flow": "Hook (you're falling!) → Setup (Newton connected apple & Moon) → Content (the actual equation with stalker metaphor + inverse square as flashlight) → Reveal (EVERYTHING pulls EVERYTHING) → Key Point (weak but relentless wins) → Exam Tip (classic JEE trap with R²) → CTA (now you feel it)",
  "manim_edu_components": [
    "FieldVisualizer",
    "MechanicsSimulator",
    "WaveSimulator"
  ]
}