{
  "core_analogy": "Gravity = Universe's clingy ex who NEVER lets go. The bigger they are, the harder they pull. Earth is obsessed with you, but you're also pulling Earth back (she just doesn't notice because you're tiny compared to her ego)",
  "subconscious_hook": "Identity challenge + Curiosity gap: 'You think you're standing still? WRONG. You're in a constant tug-of-war with a 6 trillion trillion kg stalker.' This challenges their perception of reality and creates urgency to understand.",
  "visual_scenes": {
    "01_hook": "Person standing confidently, then camera zooms out to show arrows pulling them toward Earth's core. Text: 'You're FALLING right now'. Earth shown as a giant magnet with heart eyes staring at the person.",
    "02_setup": "Split screen: Left shows apple falling (Newton moment), Right shows Moon orbiting. Question mark connecting them. 'Same force? Really?' - builds the mystery gap.",
    "03_content_part1": "FieldVisualizer showing gravitational field lines emanating from Earth like a spider web. Two spheres (Earth and Moon) with arrows showing mutual attraction. Formula F = Gm₁m₂/r² appears piece by piece with each variable lighting up as explained.",
    "03_content_part2": "MechanicsSimulator: Two people on ice rink pushing each other - bigger person barely moves, smaller person flies back. 'Same force, different acceleration!' This explains why Earth doesn't visibly move toward us.",
    "03_content_part3": "Distance squared visualization: Show two masses at distance r, then double the distance to 2r. Force arrows shrink to 1/4 size. 'Double distance = Quarter force. That's why you don't feel the Sun pulling you as much as Earth.'",
    "04_reveal": "Zoom out from Earth to show Sun, then galaxy, then universe - all connected by invisible gravity strings. 'You're connected to EVERY mass in the universe right now. Every star is pulling you.' Mind-explosion animation.",
    "05_key_point": "Three golden rules appear as floating cards: '1) Every mass attracts every mass 2) Force depends on BOTH masses 3) Distance SQUARED kills the force'. The 'squared' pulses with emphasis.",
    "06_exam_tip": "JEE question flash: 'If Earth's radius doubled but mass same, your weight becomes?' Calculator shows: g' = GM/(2R)² = g/4. 'You'd weigh 1/4th! This is WHY they ask radius questions.'",
    "07_cta": "Person floating slightly off ground with Earth reaching up lovingly. 'Want more physics that'll make your brain do THIS? Follow for daily mind-blows. Comment 'G' if gravity just clicked!'"
  },
  "virality_factor": "The 'clingy ex' metaphor is screenshot-worthy and shareable in group chats. The revelation that you're pulling Earth back (and connected to every star) creates 'I need to tell someone this' urgency. The ice rink analogy is visually memorable.",
  "mind_blow_moment": "You're not just being pulled by Earth - you're pulling Earth toward you with the EXACT same force. And right now, a star 1000 light years away is pulling you too. You're gravitationally connected to the entire universe.",
  "duration_target": "80s",
  "simplification_strategy": "G (gravitational constant) = 'Universe's relationship counselor that decides how clingy gravity gets'. m₁m₂ = 'Both masses matter - it takes two to tango'. r² = 'Distance is a relationship killer - double it and the spark drops to 1/4'. Every formula piece gets a human relationship parallel.",
  "logic_flow": "Hook (you're falling!) → Setup (apple and Moon same force?) → Content (formula breakdown with ice rink analogy) → Reveal (you're connected to universe) → Key Point (3 golden rules) → Exam Tip (radius-squared trick) → CTA (follow for more)",
  "manim_edu_components": [
    "FieldVisualizer",
    "MechanicsSimulator",
    "WaveSimulator"
  ]
}