[
  {
    "id": "01_hook",
    "text": "अभी इस moment... आप FALL कर रहे हो! रुको, बैठे हो ना? फिर भी... FALLING! कैसे?",
    "duration": 6.360000,
    "startTime": 0,
    "endTime": 6.360000
  },
  {
    "id": "02_setup",
    "text": "Newton ने देखा apple गिरा... फिर Moon को देखा जो Earth के around घूम रहा है। उनका GENIUS question था... क्या SAME force है? Apple को खींचने वाली और Moon को रोकने वाली?",
    "duration": 11.064000,
    "startTime": 6.360000,
    "endTime": 17.424000
  },
  {
    "id": "03_content_part1",
    "text": "देखो gravity का formula! F equals G into M one M two divided by r squared. यहाँ G है six point six seven into ten to the power minus eleven... इतना TINY number! Gravity actually universe की WEAKEST force है भाई!",
    "duration": 14.400000,
    "startTime": 17.424000,
    "endTime": 31.824000
  },
  {
    "id": "03_content_part2",
    "text": "अब समझो inverse square law! Distance DOUBLE करो... force ONE FOURTH हो जाती है! Triple करो... force ONE NINTH! क्यों? जैसे flashlight की light दूर जाके SPREAD होती है... वैसे ही gravity WEAK होती है distance के square से!",
    "duration": 15.864000,
    "startTime": 31.824000,
    "endTime": 47.688000
  },
  {
    "id": "04_reveal",
    "text": "Mind blowing fact! अभी इस second... Earth आपको खींच रही है... Moon खींच रहा है... Sun खींच रहा है... EVEN the person sitting next to you is PULLING you! Gravitationally! EVERYTHING pulls EVERYTHING... हमेशा!",
    "duration": 13.848000,
    "startTime": 47.688000,
    "endTime": 61.536000
  },
  {
    "id": "05_key_point",
    "text": "Gravity इतनी weak है कि एक छोटा सा magnet Earth की PURI gravity को beat कर देता है! फिर भी galaxies GRAVITY से बनती हैं! क्यों? Because gravity NEVER gives up... NEVER repels... सिर्फ ATTRACTS! Weak but RELENTLESS!",
    "duration": 14.304000,
    "startTime": 61.536000,
    "endTime": 75.840000
  },
  {
    "id": "06_exam_tip",
    "text": "J. E. E. TRAP alert! अगर Earth की mass DOUBLE हो और radius भी DOUBLE हो... g का क्या होगा? Formula है g equals G M by R squared. Mass double means numerator times two... R squared means denominator times FOUR! Answer? g becomes HALF! याद रखो... R SQUARED in denominator!",
    "duration": 20.400000,
    "startTime": 75.840000,
    "endTime": 96.240000
  },
  {
    "id": "07_cta",
    "text": "अब FEEL हो रहा है ना gravity? ये invisible force जो आपको Earth से चिपकाए रखी है! More physics जो आपका brain rewire करे... JeetLo! Follow कीजिए!",
    "duration": 10.248000,
    "startTime": 96.240000,
    "endTime": 106.488000
  }
]
