{
  "core_analogy": "Touching = Two bouncers (electron clouds) pushing each other away at the VIP rope. You NEVER actually enter the club - you just feel the push.",
  "subconscious_hook": "Identity challenge + Mind-blow. 'You've been living a lie your whole life' triggers ego defense → must watch to prove/disprove. Also existential curiosity - challenges fundamental assumption about reality.",
  "visual_scenes": {
    "01_hook": "Hand reaching toward table surface. Just before contact - FREEZE. Big red 'X' appears. Text: 'This NEVER happens'. Hand and table shown with tiny gap between them, zoom into the gap.",
    "02_setup": "Zoom into finger and table at atomic level. Show atoms as spheres with fuzzy electron clouds around them. Two clouds approaching each other. Question mark floating: 'What actually happens here?'",
    "03_content_part1": "Show two atoms approaching. Electron clouds visualized as glowing fuzzy spheres. As they get close, clouds start repelling - show field lines pushing against each other. Label: 'Electromagnetic Repulsion'. Bouncer analogy: two buff bouncers at club entrances pushing against each other, neither letting anyone through.",
    "03_content_part2": "Graph showing repulsion force vs distance. As distance decreases, force SKYROCKETS exponentially. Show the curve going vertical. Text: '10^-10 meters = INFINITE WALL'. Visual of atoms vibrating but maintaining gap.",
    "04_reveal": "Pull back to show hand 'touching' table. Zoom reveals nanometer gap between surfaces. Electron clouds shown pushing. Text: 'You're floating 0.1 nanometers above EVERYTHING'. Show person sitting on chair - actually hovering. Walking - actually hovering. Mind-blown emoji effect.",
    "05_key_point": "Split screen: What you THINK (solid contact) vs REALITY (electron cloud repulsion). Key formula: F ∝ 1/r². 'The closer you try, the harder it pushes back'. Like trying to push same poles of magnets together.",
    "06_exam_tip": "JEE/NEET connection: This is Pauli Exclusion Principle + Electromagnetic Force in action. Question flash: 'Why can't two electrons occupy same orbital?' Same reason - electron clouds REFUSE to overlap. Show quick MCQ format.",
    "07_cta": "You just learned why you've never TRULY touched anything in your life. Follow for more physics that breaks your brain. JeetLo logo with tagline."
  },
  "virality_factor": "Existential revelation that challenges DAILY experience. Every time viewer touches something after watching, they'll remember this. Highly shareable 'did you know' content. Screenshot moment: 'You're floating 0.1 nanometers above EVERYTHING'",
  "mind_blow_moment": "The reveal that sitting, walking, typing - you're ALWAYS hovering. You've never touched anything in your entire life. Not your phone, not your loved ones, not anything. Just electron clouds pushing back.",
  "duration_target": "78s",
  "simplification_strategy": "Bouncer analogy makes electromagnetic repulsion intuitive. No equations except simple inverse square mention. 'Electron cloud' not 'probability density function'. 'Push back' not 'Coulomb repulsion'. Nanometer = 'thickness of 1/1000th of a hair'",
  "logic_flow": "Hook (you can't touch) → Setup (what happens at atomic level?) → Content (electron clouds repel like bouncers) → Reveal (you're always floating!) → Key Point (this is electromagnetic force) → Exam Tip (Pauli Exclusion Principle) → CTA",
  "manim_edu_components": [
    "FieldVisualizer",
    "WaveSimulator"
  ],
  "segments": {
    "01_hook": {
      "text_hinglish": "तुमने अपनी पूरी life में कभी कुछ TOUCH नहीं किया। Seriously. वो phone जो तुम पकड़े हो? You're NOT touching it.",
      "duration": 5,
      "emotion": "excited"
    },
    "02_setup": {
      "text_hinglish": "जब तुम्हारी finger table को 'touch' करती है, atomic level पर actually क्या होता है? Zoom करते हैं।",
      "duration": 6,
      "emotion": "curious"
    },
    "03_content_part1": {
      "text_hinglish": "हर atom के around एक electron cloud होता है। जब दो atoms पास आते हैं, ये clouds एक दूसरे को PUSH करते हैं। Imagine करो दो bouncers club के entrance पर - कोई भी अंदर नहीं जा सकता। Electrons same charge हैं, तो वो repel करते हैं।",
      "duration": 15,
      "emotion": "informative"
    },
    "03_content_part2": {
      "text_hinglish": "और ये repulsion force? जितना close जाओ, उतना STRONG होता है। Exponentially! 10 to the power minus 10 meters पर, it's basically an INFINITE wall।",
      "duration": 10,
      "emotion": "informative"
    },
    "04_reveal": {
      "text_hinglish": "So right now, तुम अपनी chair पर FLOAT कर रहे हो। Zero point one nanometer ऊपर। तुम walk करते हो? Floating. Phone पकड़े हो? Floating. तुमने कभी कुछ TRULY touch नहीं किया!",
      "duration": 10,
      "emotion": "triumphant"
    },
    "05_key_point": {
      "text_hinglish": "याद रखो: Electromagnetic repulsion between electron clouds. Force is proportional to one by r square. जितना close, उतना ज़्यादा pushback. Same poles of magnets की तरह - NEVER touch।",
      "duration": 8,
      "emotion": "serious"
    },
    "06_exam_tip": {
      "text_hinglish": "J. E. E. और N. E. E. T. में यही Pauli Exclusion Principle है। दो electrons same state में क्यों नहीं हो सकते? SAME reason - electron clouds overlap नहीं कर सकते।",
      "duration": 8,
      "emotion": "informative"
    },
    "07_cta": {
      "text_hinglish": "तुमने अभी सीखा कि तुमने life में कुछ भी touch नहीं किया। ऐसी और physics के लिए follow करो। JeetLo।",
      "duration": 5,
      "emotion": "warm"
    }
  },
  "total_duration_estimate": 67
}